fduan001/F2812_SAMPLER/INCDIR/HF2812/DSP28_Mcbsp.h
//
//      TMDX ALPHA RELEASE
//      Intended for product evaluation purposes
//
//###########################################################################
//
// FILE:	DSP28_Mcbsp.h
//
// TITLE:	DSP28 Device McBSP Register Definitions.
//
//###########################################################################
//
//  Ver | dd mmm yyyy | Who  | Description of changes
// =====|=============|======|===============================================
//  0.55| 06 May 2002 | L.H. | EzDSP Alpha Release
//  0.56| 20 May 2002 | L.H. | No change
//  0.57| 27 May 2002 | L.H. | No change
//###########################################################################

#ifndef DSP28_MCBSP_H
#define DSP28_MCBSP_H
#include "F2812_datatype.h"
//---------------------------------------------------------------------------
// McBSP Individual Register Bit Definitions:
//
// McBSP DRR2 register bit definitions:
struct  DRR2_BITS       // bit   description
{
    UINT16     HWLB: 8;    // 16:23 High word low byte
    UINT16     HWHB: 8;    // 24:31 High word high byte
};

union DRR2_REG
{
    UINT16              all;
    struct DRR2_BITS  bit;
};

// McBSP DRR1 register bit definitions:
struct  DRR1_BITS       // bit   description
{
    UINT16     LWLB: 8;    // 16:23 Low word low byte
    UINT16     LWHB: 8;    // 24:31 low word high byte
};

union DRR1_REG
{
    UINT16              all;
    struct DRR1_BITS  bit;
};

// McBSP DXR2 register bit definitions:
struct  DXR2_BITS       // bit   description
{
    UINT16     HWLB: 8;    // 16:23 High word low byte
    UINT16     HWHB: 8;    // 24:31 High word high byte
};

union DXR2_REG
{
    UINT16              all;
    struct DXR2_BITS  bit;
};

// McBSP DXR1 register bit definitions:
struct  DXR1_BITS       // bit   description
{
    UINT16     LWLB: 8;    // 16:23 Low word low byte
    UINT16     LWHB: 8;    // 24:31 low word high byte
};

union DXR1_REG
{
    UINT16              all;
    struct DXR1_BITS  bit;
};

// SPCR2 control register bit definitions:
struct  SPCR2_BITS       // bit   description
{
    UINT16     XRST: 1;     // 0     transmit reset
    UINT16     XRDY: 1;     // 1     transmit ready
    UINT16     XEMPTY: 1;   // 2     Transmit empty
    UINT16     XSYNCERR: 1; // 3     Transmit syn errorINT flag
    UINT16     XINTM: 2;    // 5:4   Transmit interrupt types
    UINT16     GRST: 1;     // 6     CLKG reset
    UINT16     FRST: 1;     // 7     Frame sync reset
    UINT16     SOFT: 1;     // 8     SOFT bit
    UINT16     FREE: 1;     // 9     FREE bit
    UINT16     rsvd: 6;     // 15:10 reserved
};

union SPCR2_REG
{
    UINT16               all;
    struct SPCR2_BITS  bit;
};

// SPCR1 control register bit definitions:
struct  SPCR1_BITS       // bit   description
{
    UINT16     RRST: 1;     // 0     Receive reset
    UINT16     RRDY: 1;     // 1     Receive  ready
    UINT16     REMPTY: 1;   // 2     Receive  empty
    UINT16     RSYNCERR: 1; // 7     Receive  syn errorINT flag
    UINT16     RINTM: 2;    // 5:4   Receive  interrupt types
    UINT16     ABIS: 1;     // 6     ABIS mode select
    UINT16     DXENA: 1;    // 7     DX hi-z enable
    UINT16     rsvd: 3;     // 10:8  reserved
    UINT16     CLKSTP: 2;   // 12:11 CLKSTOP mode bit
    UINT16     RJUST: 2;    // 13:14 Right justified
    UINT16     DLB: 1;      // 15    Digital loop back    reserved
};

union SPCR1_REG
{
    UINT16              all;
    struct SPCR1_BITS bit;
};

// RCR2 control register bit definitions:
struct  RCR2_BITS         // bit    description
{
    UINT16     RDATDLY: 2;   // 1:0    Receive data delay
    UINT16     RFIG: 1;      // 2      Receive  frame sync ignore
    UINT16     RCOMPAND: 2;  // 4:3    Receive  Companding Mode selects
    UINT16     RWDLEN2: 3;   // 7:5    Receive  word length
    UINT16     RFRLEN2: 7;   // 14:8   Receive  Frame sync
    UINT16     RPHASE: 1;    // 15     Receive Phase
};

union RCR2_REG
{
    UINT16             all;
    struct RCR2_BITS bit;
};

// RCR1 control register bit definitions:
struct  RCR1_BITS         // bit   description
{
    UINT16     rsvd1: 5;     // 4:0   reserved
    UINT16     RWDLEN1: 3;   // 7:5   Receive  word length
    UINT16     RFRLEN1: 7;   // 14:8  Receive  Frame sync
    UINT16     rsvd2: 1;     // 15    reserved
};

union RCR1_REG
{
    UINT16             all;
    struct RCR1_BITS bit;
};

// XCR2 control register bit definitions:

struct  XCR2_BITS         // bit    description
{
    UINT16     XDATDLY: 2;   // 1:0    Transmit data delay
    UINT16     XFIG: 1;      // 2      Transmit frame sync ignore
    UINT16     XCOMPAND: 2;  // 4:3    Transmit Companding Mode selects
    UINT16     XWDLEN2: 3;   // 7:5    Transmit  word length
    UINT16     XFRLEN2: 7;   // 14:8   Transmit  Frame sync
    UINT16     XPHASE: 1;    // 15     Transmit Phase
};

union XCR2_REG
{
    UINT16             all;
    struct XCR2_BITS bit;
};

// XCR1 control register bit definitions:
struct  XCR1_BITS         // bit   description
{
    UINT16     rsvd1: 5;     // 4:0   reserved
    UINT16     XWDLEN1: 3;   // 7:5   Transmit word length
    UINT16     XFRLEN1: 7;   // 14:8  Transmit  Frame sync
    UINT16     rsvd2: 1;     // 15    reserved
};

union XCR1_REG
{
    UINT16             all;
    struct XCR1_BITS bit;
};

// SRGR2 Sample rate generator control register bit definitions:
struct  SRGR2_BITS        // bit  description
{
    UINT16     FPER: 12;     // 11:0 Frame period
    UINT16     FSGM: 1;      // 12   Frame sync generator mode
    UINT16     CLKSM: 1;     // 13   Sample rate generator mode
    UINT16     CLKSP: 1;     // 14   Reserved in this McBSP
    UINT16     GYSNC: 1;     // 15   CLKG sync
};

union  SRGR2_REG
{
    UINT16                all;
    struct  SRGR2_BITS  bit;
};

// SRGR1 control register bit definitions:
struct  SRGR1_BITS        // bit   description
{
    UINT16     CLKGDV: 8;    // 7:0   CLKG divider
    UINT16     FWID: 8;      // 15:8  Frame width
};

union  SRGR1_REG
{
    UINT16                all;
    struct  SRGR1_BITS  bit;
};

