fduan001/F2812_SAMPLER/INCDIR/HF2812/DSP28_Mcbsp.h
// MCR2 Multichannel control register bit definitions:
struct  MCR2_BITS         // bit   description
{
    UINT16     XMCM: 2;      // 1:0   Transmit multichannel mode
    UINT16     XCBLK: 3;     // 2:4   Transmit current block
    UINT16     XPABLK: 2;    // 5:6   Transmit partition A Block
    UINT16     XPBBLK: 2;    // 7:8   Transmit partition B Block
    UINT16     XMCME: 1;     // 9     Transmit multi-channel enhance mode
    UINT16     rsvd: 6;      // 15:10 reserved
};

union  MCR2_REG
{
    UINT16               all;
    struct  MCR2_BITS  bit;
};

// MCR1 Multichannel control register bit definitions:
struct  MCR1_BITS         // bit   description
{
    UINT16     RMCM: 1;      // 0     Receive multichannel mode
    UINT16     rsvd: 1;      // 1     reserved
    UINT16     RCBLK: 3;     // 4:2   Receive current block
    UINT16     RPABLK: 2;    // 6:5   Receive partition A Block
    UINT16     RPBBLK: 2;    // 7:8   Receive partition B Block
    UINT16     RMCME: 1;     // 9     Receive multi-channel enhance mode
    UINT16     rsvd1: 6;     // 15:10 reserved
};

union  MCR1_REG
{
    UINT16               all;
    struct  MCR1_BITS  bit;
};

// RCERA control register bit definitions:
struct  RCERA_BITS         // bit description
{
    UINT16     RCEA0: 1;      // 0   Receive Channel enable bit
    UINT16     RCEA1: 1;      // 1   Receive Channel enable bit
    UINT16     RCEA2: 1;      // 2   Receive Channel enable bit
    UINT16     RCEA3: 1;      // 3   Receive Channel enable bit
    UINT16     RCEA4: 1;      // 4   Receive Channel enable bit
    UINT16     RCEA5: 1;      // 5   Receive Channel enable bit
    UINT16     RCEA6: 1;      // 6   Receive Channel enable bit
    UINT16     RCEA7: 1;      // 7   Receive Channel enable bit
    UINT16     RCEA8: 1;      // 8   Receive Channel enable bit
    UINT16     RCEA9: 1;      // 9   Receive Channel enable bit
    UINT16     RCEA10: 1;     // 10  Receive Channel enable bit
    UINT16     RCEA11: 1;     // 11  Receive Channel enable bit
    UINT16     RCEA12: 1;     // 12  Receive Channel enable bit
    UINT16     RCEA13: 1;     // 13  Receive Channel enable bit
    UINT16     RCEA14: 1;     // 14  Receive Channel enable bit
    UINT16     RCEA15: 1;     // 15  Receive Channel enable bit
};

union RCERA_REG
{
    UINT16                all;
    struct  RCERA_BITS  bit;
};

// RCERB control register bit definitions:
struct  RCERB_BITS         // bit description
{
    UINT16     RCEB0: 1;      // 0   Receive Channel enable bit
    UINT16     RCEB1: 1;      // 1   Receive Channel enable bit
    UINT16     RCEB2: 1;      // 2   Receive Channel enable bit
    UINT16     RCEB3: 1;      // 3   Receive Channel enable bit
    UINT16     RCEB4: 1;      // 4   Receive Channel enable bit
    UINT16     RCEB5: 1;      // 5   Receive Channel enable bit
    UINT16     RCEB6: 1;      // 6   Receive Channel enable bit
    UINT16     RCEB7: 1;      // 7   Receive Channel enable bit
    UINT16     RCEB8: 1;      // 8   Receive Channel enable bit
    UINT16     RCEB9: 1;      // 9   Receive Channel enable bit
    UINT16     RCEB10: 1;     // 10  Receive Channel enable bit
    UINT16     RCEB11: 1;     // 11  Receive Channel enable bit
    UINT16     RCEB12: 1;     // 12  Receive Channel enable bit
    UINT16     RCEB13: 1;     // 13  Receive Channel enable bit
    UINT16     RCEB14: 1;     // 14  Receive Channel enable bit
    UINT16     RCEB15: 1;     // 15  Receive Channel enable bit
};

union RCERB_REG
{
    UINT16                all;
    struct  RCERB_BITS  bit;
};

// XCERA control register bit definitions:
struct  XCERA_BITS         // bit description
{
    UINT16     XCEA0: 1;      // 0   Receive Channel enable bit
    UINT16     XCEA1: 1;      // 1   Receive Channel enable bit
    UINT16     XCEA2: 1;      // 2   Receive Channel enable bit
    UINT16     XCEA3: 1;      // 3   Receive Channel enable bit
    UINT16     XCEA4: 1;      // 4   Receive Channel enable bit
    UINT16     XCEA5: 1;      // 5   Receive Channel enable bit
    UINT16     XCEA6: 1;      // 6   Receive Channel enable bit
    UINT16     XCEA7: 1;      // 7   Receive Channel enable bit
    UINT16     XCEA8: 1;      // 8   Receive Channel enable bit
    UINT16     XCEA9: 1;      // 9   Receive Channel enable bit
    UINT16     XCEA10: 1;     // 10  Receive Channel enable bit
    UINT16     XCEA11: 1;     // 11  Receive Channel enable bit
    UINT16     XCEA12: 1;     // 12  Receive Channel enable bit
    UINT16     XCEA13: 1;     // 13  Receive Channel enable bit
    UINT16     XCEA14: 1;     // 14  Receive Channel enable bit
    UINT16     XCEA15: 1;     // 15  Receive Channel enable bit
};

union XCERA_REG
{
    UINT16                all;
    struct  XCERA_BITS  bit;
};

// XCERB control register bit definitions:
struct  XCERB_BITS         // bit description
{
    UINT16     XCEB0: 1;      // 0   Receive Channel enable bit
    UINT16     XCEB1: 1;      // 1   Receive Channel enable bit
    UINT16     XCEB2: 1;      // 2   Receive Channel enable bit
    UINT16     XCEB3: 1;      // 3   Receive Channel enable bit
    UINT16     XCEB4: 1;      // 4   Receive Channel enable bit
    UINT16     XCEB5: 1;      // 5   Receive Channel enable bit
    UINT16     XCEB6: 1;      // 6   Receive Channel enable bit
    UINT16     XCEB7: 1;      // 7   Receive Channel enable bit
    UINT16     XCEB8: 1;      // 8   Receive Channel enable bit
    UINT16     XCEB9: 1;      // 9   Receive Channel enable bit
    UINT16     XCEB10: 1;     // 10  Receive Channel enable bit
    UINT16     XCEB11: 1;     // 11  Receive Channel enable bit
    UINT16     XCEB12: 1;     // 12  Receive Channel enable bit
    UINT16     XCEB13: 1;     // 13  Receive Channel enable bit
    UINT16     XCEB14: 1;     // 14  Receive Channel enable bit
    UINT16     XCEB15: 1;     // 15  Receive Channel enable bit
};

union XCERB_REG
{
    UINT16                all;
    struct  XCERB_BITS  bit;
};

// PCR1 control register bit definitions:
struct  PCR1_BITS          // bit description
{
    UINT16     CLKRP: 1;      // 0   Receive Clock polarity
    UINT16     CLKXP: 1;      // 1   Transmit clock polarity
    UINT16     FSRP: 1;       // 2   Receive Frame synchronization polarity
    UINT16     FSXP: 1;       // 3   Transmit Frame synchronization polarity
    UINT16     DR_STAT: 1;    // 4   DR pin status - reserved for this McBSP
    UINT16     DX_STAT: 1;    // 5   DX pin status - reserved for this McBSP
    UINT16     CLKS_STAT: 1;  // 6   CLKS pin status - reserved for 28x -McBSP
    UINT16     SCLKME: 1;     // 7   Enhanced sample clock mode selection bit.
    UINT16     CLKRM: 1;      // 8   Receiver Clock Mode
    UINT16     CLKXM: 1;      // 9   Transmitter Clock Mode.
    UINT16     FSRM: 1;       // 10  Receive Frame Synchronization Mode
    UINT16     FSXM: 1;       // 11  Transmit Frame Synchronization Mode
    UINT16     RIOEN: 1;      // 12  General Purpose I/O Mode - reserved in this 28x-McBSP
    UINT16     XIOEN: 1;      // 13  General Purpose I/O Mode - reserved in this 28x-McBSP
    UINT16     IDEL_EN: 1;    // 14  reserved in this 28x-McBSP
    UINT16     rsvd: 1  ;     // 15  reserved
};

union PCR1_REG
{
    UINT16               all;
    struct  PCR1_BITS  bit;
};

// RCERC control register bit definitions:
struct  RCERC_BITS         // bit description
{
    UINT16     RCEC0: 1;      // 0   Receive Channel enable bit
    UINT16     RCEC1: 1;      // 1   Receive Channel enable bit
    UINT16     RCEC2: 1;      // 2   Receive Channel enable bit
    UINT16     RCEC3: 1;      // 3   Receive Channel enable bit
    UINT16     RCEC4: 1;      // 4   Receive Channel enable bit
    UINT16     RCEC5: 1;      // 5   Receive Channel enable bit
    UINT16     RCEC6: 1;      // 6   Receive Channel enable bit
    UINT16     RCEC7: 1;      // 7   Receive Channel enable bit
    UINT16     RCEC8: 1;      // 8   Receive Channel enable bit
    UINT16     RCEC9: 1;      // 9   Receive Channel enable bit
    UINT16     RCEC10: 1;     // 10  Receive Channel enable bit
    UINT16     RCEC11: 1;     // 11  Receive Channel enable bit
    UINT16     RCEC12: 1;     // 12  Receive Channel enable bit
    UINT16     RCEC13: 1;     // 13  Receive Channel enable bit
    UINT16     RCEC14: 1;     // 14  Receive Channel enable bit
    UINT16     RCEC15: 1;     // 15  Receive Channel enable bit
};

