fduan001/F2812_SAMPLER/INCDIR/HF2812/DSP28_Mcbsp.h
union RCERC_REG
{
    UINT16                all;
    struct  RCERC_BITS  bit;
};

// RCERD control register bit definitions:
struct  RCERD_BITS         // bit description
{
    UINT16     RCED0: 1;      // 0   Receive Channel enable bit
    UINT16     RCED1: 1;      // 1   Receive Channel enable bit
    UINT16     RCED2: 1;      // 2   Receive Channel enable bit
    UINT16     RCED3: 1;      // 3   Receive Channel enable bit
    UINT16     RCED4: 1;      // 4   Receive Channel enable bit
    UINT16     RCED5: 1;      // 5   Receive Channel enable bit
    UINT16     RCED6: 1;      // 6   Receive Channel enable bit
    UINT16     RCED7: 1;      // 7   Receive Channel enable bit
    UINT16     RCED8: 1;      // 8   Receive Channel enable bit
    UINT16     RCED9: 1;      // 9   Receive Channel enable bit
    UINT16     RCED10: 1;     // 10  Receive Channel enable bit
    UINT16     RCED11: 1;     // 11  Receive Channel enable bit
    UINT16     RCED12: 1;     // 12  Receive Channel enable bit
    UINT16     RCED13: 1;     // 13  Receive Channel enable bit
    UINT16     RCED14: 1;     // 14  Receive Channel enable bit
    UINT16     RCED15: 1;     // 15  Receive Channel enable bit
};

union RCERD_REG
{
    UINT16                all;
    struct  RCERD_BITS  bit;
};

// XCERC control register bit definitions:
struct  XCERC_BITS         // bit description
{
    UINT16     XCEC0: 1;      // 0   Receive Channel enable bit
    UINT16     XCEC1: 1;      // 1   Receive Channel enable bit
    UINT16     XCEC2: 1;      // 2   Receive Channel enable bit
    UINT16     XCEC3: 1;      // 3   Receive Channel enable bit
    UINT16     XCEC4: 1;      // 4   Receive Channel enable bit
    UINT16     XCEC5: 1;      // 5   Receive Channel enable bit
    UINT16     XCEC6: 1;      // 6   Receive Channel enable bit
    UINT16     XCEC7: 1;      // 7   Receive Channel enable bit
    UINT16     XCEC8: 1;      // 8   Receive Channel enable bit
    UINT16     XCEC9: 1;      // 9   Receive Channel enable bit
    UINT16     XCEC10: 1;     // 10  Receive Channel enable bit
    UINT16     XCEC11: 1;     // 11  Receive Channel enable bit
    UINT16     XCEC12: 1;     // 12  Receive Channel enable bit
    UINT16     XCEC13: 1;     // 13  Receive Channel enable bit
    UINT16     XCEC14: 1;     // 14  Receive Channel enable bit
    UINT16     XCEC15: 1;     // 15  Receive Channel enable bit
};

union XCERC_REG
{
    UINT16                all;
    struct  XCERC_BITS  bit;
};

// XCERD control register bit definitions:
struct  XCERD_BITS         // bit description
{
    UINT16     XCED0: 1;      // 0   Receive Channel enable bit
    UINT16     XCED1: 1;      // 1   Receive Channel enable bit
    UINT16     XCED2: 1;      // 2   Receive Channel enable bit
    UINT16     XCED3: 1;      // 3   Receive Channel enable bit
    UINT16     XCED4: 1;      // 4   Receive Channel enable bit
    UINT16     XCED5: 1;      // 5   Receive Channel enable bit
    UINT16     XCED6: 1;      // 6   Receive Channel enable bit
    UINT16     XCED7: 1;      // 7   Receive Channel enable bit
    UINT16     XCED8: 1;      // 8   Receive Channel enable bit
    UINT16     XCED9: 1;      // 9   Receive Channel enable bit
    UINT16     XCED10: 1;     // 10  Receive Channel enable bit
    UINT16     XCED11: 1;     // 11  Receive Channel enable bit
    UINT16     XCED12: 1;     // 12  Receive Channel enable bit
    UINT16     XCED13: 1;     // 13  Receive Channel enable bit
    UINT16     XCED14: 1;     // 14  Receive Channel enable bit
    UINT16     XCED15: 1;     // 15  Receive Channel enable bit
};

union XCERD_REG
{
    UINT16                all;
    struct  XCERD_BITS  bit;
};

// RCERE control register bit definitions:
struct  RCERE_BITS         // bit description
{
    UINT16     RCEE0: 1;      // 0   Receive Channel enable bit
    UINT16     RCEE1: 1;      // 1   Receive Channel enable bit
    UINT16     RCEE2: 1;      // 2   Receive Channel enable bit
    UINT16     RCEE3: 1;      // 3   Receive Channel enable bit
    UINT16     RCEE4: 1;      // 4   Receive Channel enable bit
    UINT16     RCEE5: 1;      // 5   Receive Channel enable bit
    UINT16     RCEE6: 1;      // 6   Receive Channel enable bit
    UINT16     RCEE7: 1;      // 7   Receive Channel enable bit
    UINT16     RCEE8: 1;      // 8   Receive Channel enable bit
    UINT16     RCEE9: 1;      // 9   Receive Channel enable bit
    UINT16     RCEE10: 1;     // 10  Receive Channel enable bit
    UINT16     RCEE11: 1;     // 11  Receive Channel enable bit
    UINT16     RCEE12: 1;     // 12  Receive Channel enable bit
    UINT16     RCEE13: 1;     // 13  Receive Channel enable bit
    UINT16     RCEE14: 1;     // 14  Receive Channel enable bit
    UINT16     RCEE15: 1;     // 15  Receive Channel enable bit
};

union RCERE_REG
{
    UINT16                all;
    struct  RCERE_BITS  bit;
};

// RCERF control register bit definitions:
struct  RCERF_BITS         // bit   description
{
    UINT16     RCEF0: 1;      // 0   Receive Channel enable bit
    UINT16     RCEF1: 1;      // 1   Receive Channel enable bit
    UINT16     RCEF2: 1;      // 2   Receive Channel enable bit
    UINT16     RCEF3: 1;      // 3   Receive Channel enable bit
    UINT16     RCEF4: 1;      // 4   Receive Channel enable bit
    UINT16     RCEF5: 1;      // 5   Receive Channel enable bit
    UINT16     RCEF6: 1;      // 6   Receive Channel enable bit
    UINT16     RCEF7: 1;      // 7   Receive Channel enable bit
    UINT16     RCEF8: 1;      // 8   Receive Channel enable bit
    UINT16     RCEF9: 1;      // 9   Receive Channel enable bit
    UINT16     RCEF10: 1;     // 10  Receive Channel enable bit
    UINT16     RCEF11: 1;     // 11  Receive Channel enable bit
    UINT16     RCEF12: 1;     // 12  Receive Channel enable bit
    UINT16     RCEF13: 1;     // 13  Receive Channel enable bit
    UINT16     RCEF14: 1;     // 14  Receive Channel enable bit
    UINT16     RCEF15: 1;     // 15  Receive Channel enable bit
};

