fduan001/F2812_SAMPLER/INCDIR/HF2812/DSP28_Mcbsp.h
union RCERF_REG
{
    UINT16                all;
    struct  RCERF_BITS  bit;
};

// XCERE control register bit definitions:
struct  XCERE_BITS         // bit description
{
    UINT16     XCEE0: 1;      // 0   Receive Channel enable bit
    UINT16     XCEE1: 1;      // 1   Receive Channel enable bit
    UINT16     XCEE2: 1;      // 2   Receive Channel enable bit
    UINT16     XCEE3: 1;      // 3   Receive Channel enable bit
    UINT16     XCEE4: 1;      // 4   Receive Channel enable bit
    UINT16     XCEE5: 1;      // 5   Receive Channel enable bit
    UINT16     XCEE6: 1;      // 6   Receive Channel enable bit
    UINT16     XCEE7: 1;      // 7   Receive Channel enable bit
    UINT16     XCEE8: 1;      // 8   Receive Channel enable bit
    UINT16     XCEE9: 1;      // 9   Receive Channel enable bit
    UINT16     XCEE10: 1;     // 10  Receive Channel enable bit
    UINT16     XCEE11: 1;     // 11  Receive Channel enable bit
    UINT16     XCEE12: 1;     // 12  Receive Channel enable bit
    UINT16     XCEE13: 1;     // 13  Receive Channel enable bit
    UINT16     XCEE14: 1;     // 14  Receive Channel enable bit
    UINT16     XCEE15: 1;     // 15  Receive Channel enable bit
};

union XCERE_REG
{
    UINT16                all;
    struct  XCERE_BITS  bit;
};

// XCERF control register bit definitions:
struct  XCERF_BITS         // bit description
{
    UINT16     XCEF0: 1;      // 0   Receive Channel enable bit
    UINT16     XCEF1: 1;      // 1   Receive Channel enable bit
    UINT16     XCEF2: 1;      // 2   Receive Channel enable bit
    UINT16     XCEF3: 1;      // 3   Receive Channel enable bit
    UINT16     XCEF4: 1;      // 4   Receive Channel enable bit
    UINT16     XCEF5: 1;      // 5   Receive Channel enable bit
    UINT16     XCEF6: 1;      // 6   Receive Channel enable bit
    UINT16     XCEF7: 1;      // 7   Receive Channel enable bit
    UINT16     XCEF8: 1;      // 8   Receive Channel enable bit
    UINT16     XCEF9: 1;      // 9   Receive Channel enable bit
    UINT16     XCEF10: 1;     // 10  Receive Channel enable bit
    UINT16     XCEF11: 1;     // 11  Receive Channel enable bit
    UINT16     XCEF12: 1;     // 12  Receive Channel enable bit
    UINT16     XCEF13: 1;     // 13  Receive Channel enable bit
    UINT16     XCEF14: 1;     // 14  Receive Channel enable bit
    UINT16     XCEF15: 1;     // 15  Receive Channel enable bit
};

union XCERF_REG
{
    UINT16                all;
    struct  XCERF_BITS  bit;
};

// RCERG control register bit definitions:
struct  RCERG_BITS         // bit description
{
    UINT16     RCEG0: 1;      // 0   Receive Channel enable bit
    UINT16     RCEG1: 1;      // 1   Receive Channel enable bit
    UINT16     RCEG2: 1;      // 2   Receive Channel enable bit
    UINT16     RCEG3: 1;      // 3   Receive Channel enable bit
    UINT16     RCEG4: 1;      // 4   Receive Channel enable bit
    UINT16     RCEG5: 1;      // 5   Receive Channel enable bit
    UINT16     RCEG6: 1;      // 6   Receive Channel enable bit
    UINT16     RCEG7: 1;      // 7   Receive Channel enable bit
    UINT16     RCEG8: 1;      // 8   Receive Channel enable bit
    UINT16     RCEG9: 1;      // 9   Receive Channel enable bit
    UINT16     RCEG10: 1;     // 10  Receive Channel enable bit
    UINT16     RCEG11: 1;     // 11  Receive Channel enable bit
    UINT16     RCEG12: 1;     // 12  Receive Channel enable bit
    UINT16     RCEG13: 1;     // 13  Receive Channel enable bit
    UINT16     RCEG14: 1;     // 14  Receive Channel enable bit
    UINT16     RCEG15: 1;     // 15  Receive Channel enable bit
};

union RCERG_REG
{
    UINT16                all;
    struct  RCERG_BITS  bit;
};

// RCERH control register bit definitions:
struct  RCERH_BITS         // bit description
{
    UINT16     RCEH0: 1;      // 0   Receive Channel enable bit
    UINT16     RCEH1: 1;      // 1   Receive Channel enable bit
    UINT16     RCEH2: 1;      // 2   Receive Channel enable bit
    UINT16     RCEH3: 1;      // 3   Receive Channel enable bit
    UINT16     RCEH4: 1;      // 4   Receive Channel enable bit
    UINT16     RCEH5: 1;      // 5   Receive Channel enable bit
    UINT16     RCEH6: 1;      // 6   Receive Channel enable bit
    UINT16     RCEH7: 1;      // 7   Receive Channel enable bit
    UINT16     RCEH8: 1;      // 8   Receive Channel enable bit
    UINT16     RCEH9: 1;      // 9   Receive Channel enable bit
    UINT16     RCEH10: 1;     // 10  Receive Channel enable bit
    UINT16     RCEH11: 1;     // 11  Receive Channel enable bit
    UINT16     RCEH12: 1;     // 12  Receive Channel enable bit
    UINT16     RCEH13: 1;     // 13  Receive Channel enable bit
    UINT16     RCEH14: 1;     // 14  Receive Channel enable bit
    UINT16     RCEH15: 1;     // 15  Receive Channel enable bit
};

union RCERH_REG
{
    UINT16                all;
    struct  RCERH_BITS  bit;
};

// XCERG control register bit definitions:
struct  XCERG_BITS         // bit description
{
    UINT16     XCEG0: 1;      // 0   Receive Channel enable bit
    UINT16     XCEG1: 1;      // 1   Receive Channel enable bit
    UINT16     XCEG2: 1;      // 2   Receive Channel enable bit
    UINT16     XCEG3: 1;      // 3   Receive Channel enable bit
    UINT16     XCEG4: 1;      // 4   Receive Channel enable bit
    UINT16     XCEG5: 1;      // 5   Receive Channel enable bit
    UINT16     XCEG6: 1;      // 6   Receive Channel enable bit
    UINT16     XCEG7: 1;      // 7   Receive Channel enable bit
    UINT16     XCEG8: 1;      // 8   Receive Channel enable bit
    UINT16     XCEG9: 1;      // 9   Receive Channel enable bit
    UINT16     XCEG10: 1;     // 10  Receive Channel enable bit
    UINT16     XCEG11: 1;     // 11  Receive Channel enable bit
    UINT16     XCEG12: 1;     // 12  Receive Channel enable bit
    UINT16     XCEG13: 1;     // 13  Receive Channel enable bit
    UINT16     XCEG14: 1;     // 14  Receive Channel enable bit
    UINT16     XCEG15: 1;     // 15  Receive Channel enable bit
};

union XCERG_REG
{
    UINT16                all;
    struct  XCERG_BITS  bit;
};

// XCERH control register bit definitions:
struct  XCERH_BITS         // bit description
{
    UINT16     XCEH0: 1;      // 0   Receive Channel enable bit
    UINT16     XCEH1: 1;      // 1   Receive Channel enable bit
    UINT16     XCEH2: 1;      // 2   Receive Channel enable bit
    UINT16     XCEH3: 1;      // 3   Receive Channel enable bit
    UINT16     XCEH4: 1;      // 4   Receive Channel enable bit
    UINT16     XCEH5: 1;      // 5   Receive Channel enable bit
    UINT16     XCEH6: 1;      // 6   Receive Channel enable bit
    UINT16     XCEH7: 1;      // 7   Receive Channel enable bit
    UINT16     XCEH8: 1;      // 8   Receive Channel enable bit
    UINT16     XCEH9: 1;      // 9   Receive Channel enable bit
    UINT16     XCEH10: 1;     // 10  Receive Channel enable bit
    UINT16     XCEH11: 1;     // 11  Receive Channel enable bit
    UINT16     XCEH12: 1;     // 12  Receive Channel enable bit
    UINT16     XCEH13: 1;     // 13  Receive Channel enable bit
    UINT16     XCEH14: 1;     // 14  Receive Channel enable bit
    UINT16     XCEH15: 1;     // 15  Receive Channel enable bit
};

union XCERH_REG
{
    UINT16                all;
    struct  XCERH_BITS  bit;
};

// McBSP FIFO Transmit register bit definitions:
struct  MFFTX_BITS        // bit   description
{
    UINT16     IL: 5;        // 4:0   Interrupt level
    UINT16     TXFFIENA: 1;  // 5     Interrupt enable
    UINT16     INT_CLR: 1;   // 6     Clear INT flag
    UINT16     INT: 1;       // 7     INT flag
    UINT16     ST: 5;        // 12:8  FIFO status
    UINT16     XRESET: 1;    // 13    FIFO reset
    UINT16     MFFENA: 1;    // 14    Enhancement enable
    UINT16     rsvd: 1;      // 15    reserved
};

union MFFTX_REG
{
    UINT16              all;
    struct MFFTX_BITS bit;
};

// McBSP FIFO recieve register bit definitions:
struct  MFFRX_BITS        // bits  description
{
    UINT16 IL: 5;            // 4:0   Interrupt level
    UINT16 RXFFIENA: 1;      // 5     Interrupt enable
    UINT16 INT_CLR: 1;       // 6     Clear INT flag
    UINT16 INT: 1;           // 7     INT flag
    UINT16 ST: 5;            // 12:8  FIFO status
    UINT16 RRESET: 1;        // 13    FIFO reset
    UINT16 OVF_CLR: 1;       // 14    Clear overflow
    UINT16 OVF: 1;           // 15    FIFO overflow
};

union MFFRX_REG
{
    UINT16              all;
    struct MFFRX_BITS bit;
};

// McBSP FIFO control register bit definitions:
struct  MFFCT_BITS        // bits  description
{
    UINT16 TXDLY: 8;        // 7:0   FIFO transmit delay
    UINT16 rsvd: 7;         // 15:7  reserved
    UINT16 IACKM: 1;        // 15    is IACK mode enable bit
};

union MFFCT_REG
{
    UINT16               all;
    struct MFFCT_BITS  bit;
};

// McBSP FIFO INTERRUPT control register bit definitions:
struct  MFFINT_BITS       // bits description
{
    UINT16     XINT: 1;     // 0    XINT  interrupt enable
    UINT16     XEVTA: 1;    // 1    XEVTA interrupt enable
    UINT16     RINT: 1;     // 2    RINT  interrupt enable
    UINT16     REVTA: 1;    // 3    REVTA interrupt enable
    UINT16     rsvd: 12;    // 15:4 reserved
};

