fduan001/F2812_SAMPLER/INCDIR/HF2812/DSP28_Mcbsp.h
union MFFINT_REG
{
    UINT16                all;
    struct MFFINT_BITS  bit;
};

// McBSP FIFO INTERRUPT status  register bit definitions:
struct  MFFST_BITS       // bits description
{
    UINT16     EOBX: 1;    // 0    EOBX flag
    UINT16     FSX: 1;     // 1    FSX flag
    UINT16     EOBR: 1;    // 2    EOBR flag
    UINT16     FSR: 1;     // 3    FSR flag
    UINT16     rsvd: 12;   // 15:4 reserved
};

union MFFST_REG
{
    UINT16              all;
    struct MFFST_BITS bit;
};


//---------------------------------------------------------------------------
// McBSP Register File:
//
struct  MCBSP_REGS
{
    union DRR2_REG    DRR2;     // 0,  MCBSP Data receive register bits 31-16
    union DRR1_REG    DRR1;     // 1,  MCBSP Data receive register bits 15-0
    union DXR2_REG    DXR2;     // 2,  MCBSP Data transmit register bits 31-16
    union DXR1_REG    DXR1;     // 3,  MCBSP Data transmit register bits 15-0
    union SPCR2_REG   SPCR2;    // 4,  MCBSP control register bits 31-16
    union SPCR1_REG   SPCR1;    // 5,  MCBSP control register bits 15-0
    union RCR2_REG    RCR2;     // 6,  MCBSP receive control register bits 31-16
    union RCR1_REG    RCR1;     // 7,  MCBSP receive control register bits 15-0
    union XCR2_REG    XCR2;     // 8,  MCBSP transmit control register bits 31-16
    union XCR1_REG    XCR1;     // 9,  MCBSP transmit control register bits 15-0
    union SRGR2_REG   SRGR2;    // 10, MCBSP sample rate gen register bits 31-16
    union SRGR1_REG   SRGR1;    // 11, MCBSP sample rate gen register bits 15-0
    union MCR2_REG    MCR2;     // 12, MCBSP multichannel register bits 31-16
    union MCR1_REG    MCR1;     // 13, MCBSP multichannel register bits 15-0
    union RCERA_REG   RCERA;    // 14, MCBSP Receive channel enable partition A
    union RCERB_REG   RCERB;    // 15, MCBSP Receive channel enable partition B
    union XCERA_REG   XCERA;    // 16, MCBSP Transmit channel enable partition A
    union XCERB_REG   XCERB;    // 17, MCBSP Transmit channel enable partition B
    union PCR1_REG    PCR1;     // 18, MCBSP Pin control register bits 15-0
    union RCERC_REG   RCERC;    // 19, MCBSP Receive channel enable partition C
    union RCERD_REG   RCERD;    // 20, MCBSP Receive channel enable partition D
    union XCERC_REG   XCERC;    // 21, MCBSP Transmit channel enable partition C
    union XCERD_REG   XCERD;    // 23, MCBSP Transmit channel enable partition D
    union RCERE_REG   RCERE;    // 24, MCBSP Receive channel enable partition E
    union RCERF_REG   RCERF;    // 25, MCBSP Receive channel enable partition F
    union XCERE_REG   XCERE;    // 26, MCBSP Transmit channel enable partition E
    union XCERF_REG   XCERF;    // 27, MCBSP Transmit channel enable partition F
    union RCERG_REG   RCERG;    // 28, MCBSP Receive channel enable partition G
    union RCERH_REG   RCERH;    // 29, MCBSP Receive channel enable partition H
    union XCERG_REG   XCERG;    // 30, MCBSP Transmit channel enable partition G
    union XCERH_REG   XCERH;    // 31, MCBSP Transmit channel enable partition H
    UINT16  rsvd1;                // 32, reserved
    union MFFTX_REG   MFFTX;    // 33, MCBSP Transmit FIFO register bits
    union MFFRX_REG   MFFRX;    // 34, MCBSP Receive FIFO register bits
    union MFFCT_REG   MFFCT;    // 35, MCBSP FIFO control register bits
    union MFFINT_REG  MFFINT;   // 36, MCBSP Interrupt register bits
    union MFFST_REG   MFFST;    // 37, MCBSP Status register bits
};

//---------------------------------------------------------------------------
// McBSP External References & Function Declarations:
//
extern volatile struct MCBSP_REGS McbspRegs;

#endif  // end of DSP28_MCBSP_H definition

//===========================================================================
// No more.
//===========================================================================
